const areaList = 
      {
        "北海道": ["札幌","函館・大沼・松前","旭川・層雲峡","釧路・阿寒・根室・川湯・屈斜路","富良野・美瑛・トマム","小樽・キロロ・積丹","網走・北見・知床","帯広・十勝","定山渓","洞爺・登別・苫小牧","石狩・空知・千歳","稚内・留萌","ニセコ・ルスツ","日高・えりも","離島（利尻・礼文・天売・焼尻）"],
        "青森県": ["八戸","弘前","青森","十和田湖","津軽西海岸","下北・三沢","津軽半島"],
        "岩手県": ["盛岡","花巻･北上･遠野","奥州・平泉・一関","安比・八幡平・二戸","雫石","三陸海岸"],
        "宮城県": ["仙台","鳴子・大崎","石巻・気仙沼","松島・塩竈","白石・蔵王","栗原・登米"],
        "秋田県": ["秋田","田沢湖・角館・大曲","白神・男鹿","十和田湖・大館・鹿角","横手・鳥海"],
        "山形県": ["山形・蔵王・天童・上山","酒田・鶴岡","米沢・置賜","尾花沢・新庄・村山","寒河江・月山"],
        "福島県": ["福島・二本松","郡山","いわき・双葉","裏磐梯・磐梯高原","会津","猪苗代・表磐梯","白河","相馬","南会津"],
        "茨城県": ["宇都宮・さくら","日光・霧降高原・奥日光・中禅寺湖・今市","那須・板室","佐野・小山・足利・鹿沼","鬼怒川・川治・湯西川・川俣","塩原・矢板・大田原・西那須野","馬頭・茂木・益子・真岡"],
        "栃木県": ["大洗・ひたちなか","水戸・笠間","霞ヶ浦・土浦・鹿島・潮来","つくば・牛久","北茨城・奥久慈・日立","常総・結城・桜川"],
        "群馬県": ["万座・嬬恋・北軽井沢","前橋・高崎・伊勢崎・太田･榛名","草津・尻焼・花敷","水上・月夜野・猿ヶ京・法師","渋川・伊香保","沼田・老神・尾瀬","赤城・桐生・渡良瀬","藤岡・碓氷・磯部・妙義","四万・吾妻・川原湯"],
        "埼玉県": ["川越・さいたま","本庄・熊谷","越谷・草加","秩父・長瀞","久喜・行田","飯能"],
        "千葉県": ["舞浜・浦安・船橋・幕張","成田","千葉・市原","松戸・柏・野田","勝浦・鴨川","木更津・君津・富津","館山・南房総","九十九里・銚子","佐倉・八街"],
        "東京都": ["お台場・汐留・新橋・品川","新宿・中野・杉並・吉祥寺","銀座・日本橋・東京駅周辺","上野・浅草・両国","渋谷・目黒・世田谷","八王子・立川・町田・府中・調布","池袋・目白・板橋・赤羽","六本木・麻布・赤坂・青山","蒲田・大森・羽田周辺","お茶の水・湯島・九段・後楽園","青梅・奥多摩","葛飾・江戸川・江東","伊豆七島・小笠原"],
        "神奈川県": ["横浜","箱根","湘南・鎌倉","川崎","湯河原・真鶴・小田原","横須賀・三浦","厚木・海老名","相模原","足柄"],
        "新潟県": ["新潟・月岡・阿賀野川","柏崎・寺泊・長岡・魚沼（湯之谷）","上越・糸魚川・妙高","湯沢・苗場","佐渡","燕・三条・岩室・弥彦","南魚沼・十日町・津南（六日町）","瀬波・村上・岩船"],
        "山梨県": ["河口湖・西湖・富士吉田・精進湖・本栖湖","甲府・湯村・昇仙峡","八ヶ岳・小淵沢・清里・大泉","山中湖・忍野","下部・身延・早川","大月・都留","石和・勝沼・塩山","南アルプス"],
        "長野県": ["長野・戸隠・小布施","松本市（上高地・乗鞍・白骨・野麦峠）","上諏訪・下諏訪・岡谷・霧ヶ峰・美ヶ原高原","伊那・駒ヶ根・飯田・昼神","松本市（松本駅周辺・浅間・美ヶ原・塩尻）","蓼科・白樺湖・車山・女神湖・姫木平","白馬・小谷","野沢温泉・木島平・秋山郷","軽井沢・佐久・小諸","安曇野・大町","上田・別所・鹿教湯","菅平・峰の原","斑尾・飯山・信濃町・黒姫","八ヶ岳・富士見・原村・野辺山・小海","木曽","志賀・北志賀・湯田中渋","戸倉上山田・千曲"],
        "富山県": ["富山","立山・黒部・宇奈月","高岡・氷見・砺波"],
        "石川県": ["金沢・羽咋","加賀・小松・辰口","輪島・能登","和倉・七尾","白山"],
        "福井県": ["福井・奥越前","三国・あわら","若狭","越前"],
        "岐阜県": ["岐阜・大垣・養老","飛騨・高山","恵那・多治見・可児・加茂","下呂・南飛騨","郡上・美濃・関","白川郷","奥飛騨"],
        "静岡県": ["下田・白浜","浜松・浜名湖","熱海","静岡・清水","御殿場・富士","伊東・宇佐美・川奈","沼津・三島","磐田・袋井・掛川","焼津・御前崎","伊豆高原","西伊豆","南伊豆","大井川・寸又峡・川根","東伊豆","中伊豆"],
        "愛知県": ["名古屋","尾張・犬山・小牧","知多","三河"],
        "三重県": ["桑名・長島・四日市・湯の山・鈴鹿","鳥羽","津・久居・美杉・松阪","志摩","伊賀・上野・名張","伊勢・二見","南鳥羽","奥伊勢","東紀州"],
        "滋賀県": ["彦根・長浜","大津","草津・守山・近江八幡","雄琴・堅田","甲賀・信楽","湖西"],
        "京都府": ["京都駅周辺","河原町・烏丸・大宮周辺","天橋立・宮津・舞鶴","綾部・福知山","嵯峨野・嵐山・高雄","祇園・東山・北白川周辺","京都南部（宇治・長岡京・山崎）","湯の花・丹波・美山","大原・鞍馬・貴船","丹後・久美浜"],
        "大阪府": ["新大阪・江坂・十三・塚本","大阪駅・梅田駅・福島・淀屋橋・本町","心斎橋・なんば・四ツ橋","大阪北部（茨木・高槻・箕面・伊丹空港）","上本町・天王寺・市内南部","大阪南部（堺・岸和田・関西空港）","大阪城・京橋・市内東部","大阪東部（寝屋川・守口・門真・東大阪）","大阪ベイエリア"],
        "兵庫県": ["神戸・有馬・明石","尼崎・宝塚・三田・篠山","淡路島","姫路・赤穂・播磨","城崎・竹野・豊岡","神鍋・鉢伏・養父・和田山","香住・浜坂・湯村"],
        "奈良県": ["奈良・斑鳩・天理","飛鳥・橿原・三輪","吉野・奥吉野"],
        "和歌山県": ["和歌山市・加太・和歌浦","本宮・新宮・中辺路","勝浦・串本・すさみ","有田・御坊・日高","高野山","白浜・龍神"],
        "鳥取県": ["米子・皆生・大山","鳥取・岩美","倉吉・三朝・湯梨浜"],
        "島根県": ["松江・安来・玉造・奥出雲","益田・浜田・津和野","出雲・大田・石見銀山","隠岐島"],
        "岡山県": ["岡山・玉野・牛窓","倉敷・総社・井笠","津山・美作三湯・蒜山","高梁・新見・吉備高原"],
        "広島県": ["広島・宮島","福山・尾道","三原・竹原・東広島・呉","庄原・三次・芸北"],
        "山口県": ["下関・宇部","岩国・柳井・周南","山口・秋芳","萩・長門"],
        "徳島県": ["徳島・鳴門","阿南・日和佐・宍喰","大歩危・祖谷・剣山"],
        "香川県": ["高松・東讃","小豆島","琴平・丸亀・坂出"],
        "愛媛県": ["松山・道後","今治・しまなみ海道","南予・宇和島","新居浜・東予"],
        "高知県": ["高知・須崎・南国","足摺・四万十","安芸・室戸"],
        "福岡県": ["福岡市（博多駅周辺・天神周辺）","久留米・原鶴・筑後川","北九州","太宰府・宗像","柳川・八女・筑後","糸島・前原"],
        "佐賀県": ["佐賀・古湯・熊の川","唐津・呼子","伊万里・有田","嬉野・武雄","太良"],
        "長崎県": ["佐世保・ハウステンボス","長崎","島原・雲仙・小浜","壱岐・対馬","平戸・松浦・田平","五島列島"],
        "熊本県": ["熊本","阿蘇","天草","八代・水俣・湯の児","人吉・球磨","玉名・山鹿・菊池","黒川・杖立・わいた"],
        "大分県": ["別府","大分","湯布院","中津・国東","九重・久住・竹田・長湯","日田・天ヶ瀬・耶馬渓"],
        "宮崎県": ["宮崎・青島・日南","日向・延岡・高千穂","えびの・都城"],
        "鹿児島県": ["鹿児島・桜島","霧島","南薩・指宿","北薩・川内","垂水・大隅","離島"],
        "沖縄県": ["那覇","本部・名護・国頭","沖縄市（コザ）・北谷・宜野湾","南部","離島","西海岸・東海岸"],
      };


function prefList(selectPref){
  
  let area = document.getElementById('area');
  area.disabled = false;
  area.innerHTML = '';
  let option = document.createElement('option');
  option.innerHTML = 'エリアを選択してください';
  option.defaultSelected = true;
  option.disabled = true;
  area.appendChild(option);  
  
  areaList[selectPref].forEach( place => {
    let option = document.createElement('option');
    option.innerHTML = place;
    area.appendChild(option);  
  });    
}